# словарь с кодом Морзе для каждой буквы и цифры
MORSE_CODE = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.',
    'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---',
    'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---',
    'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-',
    'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--',
    'Z': '--..', '0': '-----', '1': '.----', '2': '..---', '3': '...--',
    '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..',
    '9': '----.'
}

# функция для кодирования сообщения в код Морзе
def morse_encode(message):
    # переводим текст в верхний регистр
    message = message.upper()
    encoded_message = ""
    for char in message:
        # игнорируем пробелы
        if char == ' ':
            encoded_message += " "
        # используем словарь для кодирования букв и цифр
        elif char in MORSE_CODE:
            encoded_message += MORSE_CODE[char] + " "
    return encoded_message.strip()

print(morse_encode('sos'))